Adhelor/KaRadio32_4/sdkconfig.defaults.esp32
#
# ===== Target =====
#
CONFIG_IDF_TARGET="esp32"
CONFIG_IDF_TARGET_ESP32=y
CONFIG_ESP32_XTAL_FREQ_40=y
CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32_DEFAULT_CPU_FREQ_MHZ=240

#
# ===== Flash =====
#
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_BOOTLOADER_OFFSET_IN_FLASH=0x1000

#
# ===== Partition table =====
#
CONFIG_PARTITION_TABLE_CUSTOM=y

#
# ===== Display / UI =====
#
CONFIG_DISPLAY_TYPE_ALL=y

#
# ===== Bluetooth (Classic only, A2DP) =====
#
CONFIG_BT_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_BLE_ENABLED=n

CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=y
CONFIG_BTDM_CTRL_BR_EDR_MAX_ACL_CONN=2
CONFIG_BTDM_CTRL_BR_EDR_MAX_SYNC_CONN=0
CONFIG_BTDM_CTRL_BLE_MAX_CONN_EFF=0

CONFIG_BT_SPEAKER_MODE=y
CONFIG_BT_NAME="KaRadio Speaker"

CONFIG_BT_A2DP_ENABLE=y
CONFIG_BT_STACK_NO_LOG=y
CONFIG_BT_SSP_ENABLED=n

# 🔻 FLASH saving
CONFIG_BT_SMP_ENABLE=n
CONFIG_BT_BLE_DYNAMIC_ENV_MEMORY=n

# Allocate BT buffers from PSRAM first
CONFIG_BT_ALLOCATION_FROM_SPIRAM_FIRST=y

#
# ===== Blink LED =====
#
CONFIG_BLINK_LED_GPIO=y
CONFIG_BLINK_GPIO=2
CONFIG_BLINK_PERIOD=1000

#
# ===== PSRAM (required) =====
#
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

#  FLASH saving
CONFIG_SPIRAM_MEMTEST=n

# Prefer PSRAM for WiFi/LWIP buffers
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Minimal internal heap safety
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=8192

#  NO cache lib relocation (saves FLASH)
CONFIG_SPIRAM_CACHE_LIBTIME_IN_IRAM=n
CONFIG_SPIRAM_CACHE_LIBIO_IN_IRAM=n
CONFIG_SPIRAM_CACHE_LIBMATH_IN_IRAM=n
CONFIG_SPIRAM_CACHE_LIBMEM_IN_IRAM=n
CONFIG_SPIRAM_CACHE_LIBMISC_IN_IRAM=n

#
# ===== Logging =====
#
CONFIG_LOG_DEFAULT_LEVEL_ERROR=y
CONFIG_LOG_DEFAULT_LEVEL=1
CONFIG_LOG_MAXIMUM_LEVEL=1

#
# ===== Panic / Heap =====
#
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_HEAP_POISONING_DISABLED=y
CONFIG_HEAP_TRACING_OFF=y

#
# ===== Power / PM =====
#
CONFIG_PM_ENABLE=n

#
# ===== WiFi / LWIP minimal =====
#
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_LWIP_TCP_OOSEQ_MAX_PBUFS=4
CONFIG_LWIP_DNS_SETSERVER_WITH_NETIF=y
CONFIG_LWIP_LOCAL_HOSTNAME="KaRadio"

#
# ===== ADC / Calibration =====
#
CONFIG_ADC_CAL_EFUSE_TP_ENABLE=y
CONFIG_ADC_CAL_EFUSE_VREF_ENABLE=y
CONFIG_ADC_CAL_LUT_ENABLE=y
